## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 2 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| add      | `module.ai_answers_vpc.aws_route_table_association.private[1]` |
|          | `module.ai_answers_vpc.aws_route_table_association.public[1]`  |
|          | `module.ai_answers_vpc.aws_subnet.private[1]`                  |
|          | `module.ai_answers_vpc.aws_subnet.public[1]`                   |
| update   | `module.ai_answers_vpc.aws_network_acl.main`                   |
|          | `module.ai_answers_vpc.aws_route.private_nat_gateway[0]`       |
| recreate | `module.ai_answers_vpc.aws_nat_gateway.nat_gw[0]`              |
|          | `module.ai_answers_vpc.aws_route_table_association.public[0]`  |
|          | `module.ai_answers_vpc.aws_subnet.public[0]`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ update in-place
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ destroy and then create replacement
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_nat_gateway.nat_gw[0] must be replaced
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_nat_gateway" "nat_gw" {
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ association_id                     = "eipassoc-0a59ede0701d73851" -> (known after apply)
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                                 = "nat-0b657eaf29dd2fe80" -> (known after apply)
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ network_interface_id               = "eni-0d23987a03ea9f4e3" -> (known after apply)
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ private_ip                         = "10.0.0.116" -> (known after apply)
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ public_ip                          = "3.97.125.165" -> (known after apply)
[0;90m22:56:41.616[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - secondary_allocation_ids           = [] -> null
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ secondary_private_ip_address_count = 0 -> (known after apply)
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ secondary_private_ip_addresses     = [] -> (known after apply)
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ subnet_id                          = "subnet-08873cd834328f0b2" -> (known after apply) # forces replacement
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                               = {
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "CostCentre" = "ai-answers-staging"
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"       = "ai-answers-natgw-0"
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Terraform"  = "true"
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (3 unchanged attributes hidden)
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_network_acl.main will be updated in-place
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ resource "aws_network_acl" "main" {
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        id         = "acl-08c69ce76a3122bef"
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ subnet_ids = [
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "subnet-03d2b39863e8cb577",
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "subnet-08873cd834328f0b2",
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ] -> (known after apply)
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags       = {
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "CostCentre" = "ai-answers-staging"
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"       = "ai-answers_main_nacl"
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Terraform"  = "true"
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (6 unchanged attributes hidden)
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_route.private_nat_gateway[0] will be updated in-place
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ resource "aws_route" "private_nat_gateway" {
[0;90m22:56:41.617[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        id                          = "r-rtb-0c47b78f72ad2c1f41080289494"
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ nat_gateway_id              = "nat-0b657eaf29dd2fe80" -> (known after apply)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (17 unchanged attributes hidden)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged block hidden)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_route_table_association.private[1] will be created
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route_table_association" "private" {
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id = "rtb-0c47b78f72ad2c1f4"
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_id      = (known after apply)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_route_table_association.public[0] must be replaced
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route_table_association" "public" {
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id             = "rtbassoc-0602b370d4b567f31" -> (known after apply)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ subnet_id      = "subnet-08873cd834328f0b2" -> (known after apply) # forces replacement
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (2 unchanged attributes hidden)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_route_table_association.public[1] will be created
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route_table_association" "public" {
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id = "rtb-0997622fe2a042086"
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_id      = (known after apply)
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_subnet.private[1] will be created
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_subnet" "private" {
[0;90m22:56:41.618[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                            = (known after apply)
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assign_ipv6_address_on_creation                = false
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone                              = "ca-central-1b"
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone_id                           = (known after apply)
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_block                                     = "10.0.0.64/26"
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_dns64                                   = false
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                             = (known after apply)
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_native                                    = false
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + map_public_ip_on_launch                        = false
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id                                       = (known after apply)
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                                           = {
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_private_subnet_ca-central-1b"
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Tier"       = "Private"
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                                       = {
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:56:41.619[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_private_subnet_ca-central-1b"
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Tier"       = "Private"
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                                         = "vpc-0659c9b2d7046368f"
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + timeouts {
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + delete = "40m"
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_subnet.public[0] must be replaced
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_subnet" "public" {
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                                            = "arn:aws:ec2:ca-central-1:992382783569:subnet/subnet-08873cd834328f0b2" -> (known after apply)
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ availability_zone_id                           = "cac1-az1" -> (known after apply)
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ cidr_block                                     = "10.0.0.64/26" -> "10.0.0.128/26" # forces replacement
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - enable_lni_at_device_index                     = 0 -> null
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                                             = "subnet-08873cd834328f0b2" -> (known after apply)
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - map_customer_owned_ip_on_launch                = false -> null
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id                                       = "992382783569" -> (known after apply)
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                                           = {
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "CostCentre" = "ai-answers-staging"
[0;90m22:56:41.620[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"       = "ai-answers_public_subnet_ca-central-1a"
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Terraform"  = "true"
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Tier"       = "Public"
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (12 unchanged attributes hidden)
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_subnet.public[1] will be created
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_subnet" "public" {
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                            = (known after apply)
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assign_ipv6_address_on_creation                = false
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone                              = "ca-central-1b"
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone_id                           = (known after apply)
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_block                                     = "10.0.0.192/26"
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_dns64                                   = false
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                             = (known after apply)
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_native                                    = false
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + map_public_ip_on_launch                        = false
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id                                       = (known after apply)
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m22:56:41.621[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                                           = {
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_public_subnet_ca-central-1b"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Tier"       = "Public"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                                       = {
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_public_subnet_ca-central-1b"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Tier"       = "Public"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                                         = "vpc-0659c9b2d7046368f"
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 7 to add, 2 to change, 3 to destroy.
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ vpc_private_subnet_ids = [
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        "subnet-03d2b39863e8cb577",
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + (known after apply),
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    ]
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ vpc_public_subnet_ids  = [
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - "subnet-08873cd834328f0b2",
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + (known after apply),
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + (known after apply),
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    ]
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m22:56:41.622[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.app"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
